IRP/src/InformationRegisters/T2014S_AdvancesInfo/T2014S_AdvancesInfo.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>T2014S_AdvancesInfo</name>
 <writeMode>RecorderSubordinate</writeMode>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>IsPurchaseOrderClose</name>
  <type>
   <types>Boolean</types>
  </type>
 </resources>
 <resources>
  <name>IsSalesOrderClose</name>
  <type>
   <types>Boolean</types>
  </type>
 </resources>
 <resources>
  <name>RecordType</name>
  <type>
   <types>EnumRef.RecordType</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Date</name>
  <type>
   <types>Date</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Key</name>
  <type>
   <types>DefinedType.typeRowID</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </dimensions>
 <dimensions>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Order</name>
  <type>
   <types>DocumentRef.PurchaseOrder</types>
   <types>DocumentRef.SalesOrder</types>
  </type>
 </dimensions>
 <dimensions>
  <name>IsVendorAdvance</name>
  <type>
   <types>Boolean</types>
  </type>
 </dimensions>
 <dimensions>
  <name>IsCustomerAdvance</name>
  <type>
   <types>Boolean</types>
  </type>
 </dimensions>
 <dimensions>
  <name>UniqueID</name>
  <type>
   <types>DefinedType.typeRowID</types>
  </type>
 </dimensions>
 <dimensions>
  <name>AdvanceAgreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Project</name>
  <type>
   <types>CatalogRef.Projects</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/Enums/RecordType/RecordType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>RecordType</name>
 <enumValues>
  <name>Expense</name>
 </enumValues>
 <enumValues>
  <name>Receipt</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/ApArPostingDetail/ApArPostingDetail.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>ApArPostingDetail</name>
 <enumValues>
  <name>ByDocuments</name>
 </enumValues>
 <enumValues>
  <name>ByAgreements</name>
 </enumValues>
 <enumValues>
  <name>ByStandardAgreement</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Documents/SalesOrderClosing/SalesOrderClosing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>SalesOrderClosing</name>
 <registerRecords>AccumulationRegister.TM1010B_RowIDMovements</registerRecords>
 <registerRecords>AccumulationRegister.R2010T_SalesOrders</registerRecords>
 <registerRecords>AccumulationRegister.R2014T_CanceledSalesOrders</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_RowIDSerialLotNumbers</registerRecords>
 <registerRecords>AccumulationRegister.R2011B_SalesOrdersShipment</registerRecords>
 <registerRecords>InformationRegister.T2014S_AdvancesInfo</registerRecords>
 <registerRecords>AccumulationRegister.R3026B_SalesOrdersCustomerAdvance</registerRecords>
 <registerRecords>AccumulationRegister.R2021B_CustomersTransactions</registerRecords>
 <registerRecords>AccumulationRegister.R4011B_FreeStocks</registerRecords>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <registerRecords>AccumulationRegister.R4012B_StockReservation</registerRecords>
 <registerRecords>AccumulationRegister.R5020B_PartnersBalance</registerRecords>
 <registerRecords>AccumulationRegister.R2013T_SalesOrdersProcurement</registerRecords>
 <registerRecords>AccumulationRegister.R5011B_CustomersAging</registerRecords>
 <registerRecords>AccumulationRegister.R2020B_AdvancesFromCustomers</registerRecords>
 <registerRecords>AccumulationRegister.R4034B_GoodsShipmentSchedule</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_AccountingAmounts</registerRecords>
 <registerRecords>AccumulationRegister.R3024B_SalesOrdersToBePaid</registerRecords>
 <registerRecords>AccumulationRegister.R2012B_SalesOrdersInvoiceClosing</registerRecords>
 <attributes>
  <name>Agreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </attributes>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>SalesOrder</name>
  <type>
   <types>DocumentRef.SalesOrder</types>
  </type>
 </attributes>
 <attributes>
  <name>TransactionType</name>
  <type>
   <types>EnumRef.SalesTransactionTypes</types>
  </type>
 </attributes>
 <tabularSections>
  <name>ItemList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Cancel</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>CancelReason</name>
   <type>
    <types>CatalogRef.CancelReturnReasons</types>
   </type>
  </attributes>
  <attributes>
   <name>Item</name>
   <type>
    <types>CatalogRef.Items</types>
   </type>
  </attributes>
  <attributes>
   <name>ItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>Store</name>
   <type>
    <types>CatalogRef.Stores</types>
   </type>
  </attributes>
  <attributes>
   <name>Quantity</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>QuantityInBaseUnit</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>Unit</name>
   <type>
    <types>CatalogRef.Units</types>
   </type>
  </attributes>
  <attributes>
   <name>DeliveryDate</name>
   <type>
    <types>Date</types>
    <dateQualifiers>
     <dateFractions>Date</dateFractions>
    </dateQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ProcurementMethod</name>
   <type>
    <types>EnumRef.ProcurementMethods</types>
   </type>
  </attributes>
  <attributes>
   <name>SalesOrderKey</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>SalesPerson</name>
   <type>
    <types>CatalogRef.Partners</types>
   </type>
  </attributes>
  <attributes>
   <name>IsService</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>QuantityIsFixed</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Project</name>
   <type>
    <types>CatalogRef.Projects</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/Documents/PurchaseOrderClosing/PurchaseOrderClosing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>PurchaseOrderClosing</name>
 <registerRecords>AccumulationRegister.R1021B_VendorsTransactions</registerRecords>
 <registerRecords>AccumulationRegister.TM1010B_RowIDMovements</registerRecords>
 <registerRecords>AccumulationRegister.R3025B_PurchaseOrdersToBePaid</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_RowIDSerialLotNumbers</registerRecords>
 <registerRecords>AccumulationRegister.R1020B_AdvancesToVendors</registerRecords>
 <registerRecords>InformationRegister.T2014S_AdvancesInfo</registerRecords>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <registerRecords>AccumulationRegister.R1012B_PurchaseOrdersInvoiceClosing</registerRecords>
 <registerRecords>AccumulationRegister.R4035B_IncomingStocks</registerRecords>
 <registerRecords>AccumulationRegister.R5020B_PartnersBalance</registerRecords>
 <registerRecords>AccumulationRegister.R2013T_SalesOrdersProcurement</registerRecords>
 <registerRecords>AccumulationRegister.R5012B_VendorsAging</registerRecords>
 <registerRecords>AccumulationRegister.R1014T_CanceledPurchaseOrders</registerRecords>
 <registerRecords>AccumulationRegister.R4016B_InternalSupplyRequestOrdering</registerRecords>
 <registerRecords>AccumulationRegister.R1010T_PurchaseOrders</registerRecords>
 <registerRecords>AccumulationRegister.R4033B_GoodsReceiptSchedule</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_AccountingAmounts</registerRecords>
 <registerRecords>AccumulationRegister.R1011B_PurchaseOrdersReceipt</registerRecords>
 <attributes>
  <name>Agreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </attributes>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>PurchaseOrder</name>
  <type>
   <types>DocumentRef.PurchaseOrder</types>
  </type>
 </attributes>
 <attributes>
  <name>TransactionType</name>
  <type>
   <types>EnumRef.PurchaseTransactionTypes</types>
  </type>
 </attributes>
 <tabularSections>
  <name>ItemList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Cancel</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>CancelReason</name>
   <type>
    <types>CatalogRef.CancelReturnReasons</types>
   </type>
  </attributes>
  <attributes>
   <name>Item</name>
   <type>
    <types>CatalogRef.Items</types>
   </type>
  </attributes>
  <attributes>
   <name>ItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>Store</name>
   <type>
    <types>CatalogRef.Stores</types>
   </type>
  </attributes>
  <attributes>
   <name>Quantity</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>QuantityInBaseUnit</name>
   <type>
    <types>DefinedType.typeQuantity</types>
   </type>
  </attributes>
  <attributes>
   <name>Unit</name>
   <type>
    <types>CatalogRef.Units</types>
   </type>
  </attributes>
  <attributes>
   <name>DeliveryDate</name>
   <type>
    <types>Date</types>
    <dateQualifiers>
     <dateFractions>Date</dateFractions>
    </dateQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>PurchaseOrderKey</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>IsService</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>QuantityIsFixed</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Project</name>
   <type>
    <types>CatalogRef.Projects</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/Catalogs/Companies/Companies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Companies</name>
 <predefined>
  <items>
   <name>Default</name>
  </items>
 </predefined>
 <attributes>
  <name>Country</name>
  <type>
   <types>CatalogRef.Countries</types>
  </type>
 </attributes>
 <attributes>
  <name>MainCompany</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.CompanyLegalType</types>
  </type>
 </attributes>
 <attributes>
  <name>OurCompany</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostCurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostExpenseType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostFillEmptyAmount</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>LandedCostPriceTypeForEmptyAmount</name>
  <type>
   <types>CatalogRef.PriceTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentStore</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </attributes>
 <attributes>
  <name>TaxID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>MainPhoneNumber</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SalaryAccrualVacation</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>SalaryMaxDaysVacation</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>3</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SalaryAccrualSickLeave</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>SalaryMaxDaysSickLeave</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>3</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>SalaryBasicPayroll</name>
  <type>
   <types>CatalogRef.AccrualAndDeductionTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>PrintInfo</name>
  <type>
   <types>CatalogRef.PrintInfo</types>
  </type>
 </attributes>
 <attributes>
  <name>MainLegalAddress</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>LegalCurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </attributes>
 <attributes>
  <name>BillingEmail</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>CurrencyRevaluationItem</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </attributes>
 <attributes>
  <name>CurrencyRevaluationItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </attributes>
 <attributes>
  <name>BatchID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>EntityID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>20</length>
   </stringQualifiers>
  </type>
 </attributes>
 <tabularSections>
  <name>Currencies</name>
  <attributes>
   <name>MovementType</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/InformationRegisters/T2014S_AdvancesInfo/ManagerModule.bsl
#Region AccessObject

// Get access key.
// See Role.TemplateInformationRegisters
// 
// Returns:
//  Structure - Get access key:
// * Company - CatalogRef.Companies -
// * Branch - CatalogRef.BusinessUnits -
Function GetAccessKey() Export
	AccessKeyStructure = New Structure;
	AccessKeyStructure.Insert("Company", Catalogs.Companies.EmptyRef());
	AccessKeyStructure.Insert("Branch", Catalogs.BusinessUnits.EmptyRef());
	Return AccessKeyStructure;
EndFunction

#EndRegion

Function T2014S_AdvancesInfo_BP_CP() Export
	Return 
		"SELECT
		|	VALUE(Enum.RecordType.Receipt) AS RecordType,
		|	PaymentList.Period AS Date,
		|	PaymentList.Key,
		|	PaymentList.Company,
		|	PaymentList.Branch,
		|	PaymentList.Currency,
		|	PaymentList.Partner,
		|	PaymentList.LegalName,
		|	PaymentList.OrderSettlements AS Order,
		|	TRUE AS IsVendorAdvance,
		|	FALSE AS IsCustomerAdvance,
		|	PaymentList.AdvanceAgreement,
		|	PaymentList.Project,
		|	PaymentList.Amount
		|INTO T2014S_AdvancesInfo
		|FROM
		|	PaymentList AS PaymentList
		|WHERE
		|	PaymentList.IsPaymentToVendor
		|	AND PaymentList.IsAdvance
		|
		|UNION ALL
		|
		|SELECT
		|	VALUE(Enum.RecordType.Receipt),
		|	PaymentList.Period,
		|	PaymentList.Key,
		|	PaymentList.Company,
		|	PaymentList.Branch,
		|	PaymentList.Currency,
		|	PaymentList.Partner,
		|	PaymentList.LegalName,
		|	UNDEFINED,
		|	FALSE,
		|	TRUE,
		|	PaymentList.AdvanceAgreement,
		|	PaymentList.Project,
		|	-PaymentList.Amount AS Amount
		|FROM
		|	PaymentList AS PaymentList
		|WHERE
		|	(PaymentList.IsReturnToCustomer
		|	OR PaymentList.IsReturnToCustomerByPOS)
		|	AND PaymentList.IsAdvance";
EndFunction

Function T2014S_AdvancesInfo_BR_CR() Export
	Return 
		"SELECT
		|	VALUE(Enum.RecordType.Receipt) AS RecordType,
		|	PaymentList.Period AS Date,
		|	PaymentList.Key,
		|	PaymentList.Company,
		|	PaymentList.Branch,
		|	PaymentList.Currency,
		|	PaymentList.Partner,
		|	PaymentList.LegalName,
		|	PaymentList.AdvanceAgreement,
		|	PaymentList.Project,
		|	PaymentList.OrderSettlements AS Order,
		|	TRUE AS IsCustomerAdvance,
		|	FALSE AS IsVendorAdvance,
		|	PaymentList.Amount
		|INTO T2014S_AdvancesInfo
		|FROM
		|	PaymentList AS PaymentList
		|WHERE
		|	(PaymentList.IsPaymentFromCustomer
		|	OR PaymentList.IsPaymentFromCustomerByPOS)
		|	AND PaymentList.IsAdvance
		|
		|UNION ALL
		|
		|SELECT
		|	VALUE(Enum.RecordType.Receipt),
		|	PaymentList.Period,
		|	PaymentList.Key,
		|	PaymentList.Company,
		|	PaymentList.Branch,
		|	PaymentList.Currency,
		|	PaymentList.Partner,
		|	PaymentList.LegalName,
		|	PaymentList.AdvanceAgreement,
		|	PaymentList.Project,
		|	UNDEFINED,
		|	FALSE,
		|	TRUE,
		|	-PaymentList.Amount AS Amount
		|FROM
		|	PaymentList AS PaymentList
		|WHERE
		|	PaymentList.IsReturnFromVendor
		|	AND PaymentList.IsAdvance";
EndFunction

Function T2014S_AdvancesInfo_Cheque() Export 
	Return 
		"SELECT
		|	VALUE(Enum.RecordType.Receipt) AS RecordType,
		|	Table.Period AS Date,
		|	Table.Company,
		|	Table.Branch,
		|	Table.Currency,
		|	Table.Partner,
		|	Table.LegalName,
		|	Table.AdvanceAgreement,
		|	Table.Project,
		|	Table.OrderSettlements AS Order,
		|	TRUE AS IsCustomerAdvance,
		|	FALSE AS IsVendorAdvance,
		|	Table.Amount
		|INTO T2014S_AdvancesInfo
		|FROM
		|	CustomerTransaction_Posting AS Table
		|WHERE
		|	Table.IsIncomingCheque
		|	AND Table.IsAdvance
		|
		|UNION ALL
		|
		|SELECT
		|	VALUE(Enum.RecordType.Receipt),
		|	Table.Period,
		|	Table.Company,
		|	Table.Branch,
		|	Table.Currency,
		|	Table.Partner,
		|	Table.LegalName,
		|	Table.AdvanceAgreement,
		|	Table.Project,
		|	Table.OrderSettlements,
		|	TRUE,
		|	FALSE,
		|	-Table.Amount
		|FROM
		|	CustomerTransaction_Reversal AS Table
		|WHERE
		|	Table.IsIncomingCheque
		|	AND Table.IsAdvance
		|
		|UNION ALL
		|
		|SELECT
		|	VALUE(Enum.RecordType.Receipt),
		|	Table.Period,
		|	Table.Company,
		|	Table.Branch,
		|	Table.Currency,
		|	Table.Partner,
		|	Table.LegalName,
		|	Table.AdvanceAgreement,
		|	Table.Project,
		|	Table.OrderSettlements,
		|	TRUE,
		|	FALSE,
		|	-Table.Amount
		|FROM
		|	CustomerTransaction_Correction AS Table
		|WHERE
		|	Table.IsIncomingCheque
		|	AND Table.IsAdvance
		|
		|UNION ALL
		|
		|SELECT
		|	VALUE(Enum.RecordType.Receipt),
		|	Table.Period,
		|	Table.Company,
		|	Table.Branch,
		|	Table.Currency,
		|	Table.Partner,
		|	Table.LegalName,
		|	Table.AdvanceAgreement,
		|	Table.Project,
		|	Table.OrderSettlements,
		|	FALSE,
		|	TRUE,
		|	Table.Amount
		|FROM
		|	VendorTransaction_Posting AS Table
		|WHERE
		|	Table.IsOutgoingCheque
		|	AND Table.IsAdvance
		|
		|UNION ALL
		|
		|SELECT
		|	VALUE(Enum.RecordType.Receipt),
		|	Table.Period,
		|	Table.Company,
		|	Table.Branch,
		|	Table.Currency,
		|	Table.Partner,
		|	Table.LegalName,
		|	Table.AdvanceAgreement,
		|	Table.Project,
		|	Table.OrderSettlements,
		|	FALSE,
		|	TRUE,
		|	-Table.Amount
		|FROM
		|	VendorTransaction_Reversal AS Table
		|WHERE
		|	Table.IsOutgoingCheque
		|	AND Table.IsAdvance
		|
		|UNION ALL
		|
		|SELECT
		|	VALUE(Enum.RecordType.Receipt),
		|	Table.Period,
		|	Table.Company,
		|	Table.Branch,
		|	Table.Currency,
		|	Table.Partner,
		|	Table.LegalName,
		|	Table.AdvanceAgreement,
		|	Table.Project,
		|	Table.OrderSettlements,
		|	FALSE,
		|	TRUE,
		|	-Table.Amount
		|FROM
		|	VendorTransaction_Correction AS Table
		|WHERE
		|	Table.IsOutgoingCheque
		|	AND Table.IsAdvance";
EndFunction

Function T2014S_AdvancesInfo_SOC() Export
	Return 
		"SELECT DISTINCT
		|	VALUE(Enum.RecordType.Receipt) AS RecordType,
		|	&Period AS Date,
		|	TRUE AS IsCustomerAdvance,
		|	TRUE AS IsSalesOrderClose,
		|	CloseOrderItemList.Ref.SalesOrder.Company AS Company,
		|	CloseOrderItemList.Ref.SalesOrder.Branch AS Branch,
		|	CloseOrderItemList.Ref.SalesOrder.Currency AS Currency,
		|	CloseOrderItemList.Ref.SalesOrder.Partner AS Partner,
		|	CloseOrderItemList.Ref.SalesOrder.LegalName AS LegalName,
		|	CASE
		|		WHEN CloseOrderItemList.Ref.SalesOrder.Agreement.ApArPostingDetail = VALUE(Enum.ApArPostingDetail.ByDocuments)
		|			THEN CloseOrderItemList.Ref.SalesOrder.Agreement
		|		ELSE UNDEFINED
		|	END AS AdvanceAgreement,
		|	CloseOrderItemList.Ref.SalesOrder AS Order,
		|	CloseOrderItemList.Project AS Project
		|INTO T2014S_AdvancesInfo
		|FROM
		|	Document.SalesOrderClosing.ItemList AS CloseOrderItemList
		|WHERE
		|	CloseOrderItemList.Ref = &Ref";
EndFunction

Function T2014S_AdvancesInfo_POC() Export
	Return 
		"SELECT DISTINCT
		|	VALUE(Enum.RecordType.Receipt) AS RecordType,
		|	&Period AS Date,
		|	TRUE AS IsVendorAdvance,
		|	TRUE AS IsPurchaseOrderClose,
		|	CloseOrderItemList.Ref.PurchaseOrder.Company AS Company,
		|	CloseOrderItemList.Ref.PurchaseOrder.Branch AS Branch,
		|	CloseOrderItemList.Ref.PurchaseOrder.Currency AS Currency,
		|	CloseOrderItemList.Ref.PurchaseOrder.Partner AS Partner,
		|	CloseOrderItemList.Ref.PurchaseOrder.LegalName AS LegalName,
		|	CASE
		|		WHEN CloseOrderItemList.Ref.PurchaseOrder.Agreement.ApArPostingDetail = VALUE(Enum.ApArPostingDetail.ByDocuments)
		|			THEN CloseOrderItemList.Ref.PurchaseOrder.Agreement
		|		ELSE UNDEFINED
		|	END AS AdvanceAgreement,
		|	CloseOrderItemList.Ref.PurchaseOrder AS Order,
		|	CloseOrderItemList.Project AS Project
		|INTO T2014S_AdvancesInfo
		|FROM
		|	Document.PurchaseOrderClosing.ItemList AS CloseOrderItemList
		|WHERE
		|	CloseOrderItemList.Ref = &Ref";
EndFunction
